{
    "projects": [
        {
            "title": "Huffman Coding Compression",
            "description": "This project was for CS 314: Data Structures. In this project I had to use binary trees, and queues to do huffman encoding to compress files. The program would read a byte at a time, and count up the number of occurences of each byte in the file. The tally for each byte along with the type of byte would be placed into a priority queue. They would then be popped from the queue in order to make a binary tree. Traversing this tree would determine the new byte value for whatever node it arrived at. The new values were then written out.",
            "additionalParagraphs": [],
            "languages":[
                "java"
            ],
            "tools": [],
            "tags": [
                "school"
            ],
            "gitURL": "",
            "deployedURL": "",
            "rating": 1,
            "imageURL": "",
            "media": [],
            "videoURL": ""
        },
        {
            "title": "Bomb Lab",
            "description": "This project was for CS 429: Computer Architecture. In this lab I was assigned a \"Bomb,\" which was really just an assembly program with 6 phases. For each phase, I had to read, debug, and deconstruct the assembly code to figure out what to input in order to \"defuse\" the \"bomb.\" In the last phase I also had to read through obfuscated code to determine what to pass it.",
            "additionalParagraphs": [],
            "languages":[
                "c",
                "x-86 assembly"
            ],
            "tools": [
                "gdb"
            ],
            "tags": [
                "school"
            ],
            "gitURL": "",
            "deployedURL": "",
            "rating": 1,
            "imageURL": "",
            "media": [],
            "videoURL": ""
        },
        {
            "title": "Attack Lab",
            "description": "This project wasa for CS 429: Computer Architecture. In this lab I passed a string to a program, and intentionally overflowed the input in order to get the program to execute code it hadn't intended on executing. For the first 3 phases of this lab I was able to write in code which could be executed, and call said code. For the last 2 phases I had to find sections of code within the program which would do things, and overwrite the return adress to jump to those sections of the code.",
            "additionalParagraphs": [],
            "languages":[
                "x-86 assembly"
            ],
            "tools": [
                "gdb"
            ],
            "tags": [
                "school"
            ],
            "gitURL": "",
            "deployedURL": "",
            "rating": 2,
            "imageURL": "",
            "media": [],
            "videoURL": ""
        },
        {
            "title": "Personal Website",
            "description": "This is the website you are looking at right now! I originally created this website after graduating from high school using bootstrap and writing plain html. After learning how to use modern frontend web frameworks, I remade the site in React, again using Bootstrap. This time I customized Bootstrap's style using Sass, and structured the project to be much more extensible.",
            "additionalParagraphs": [
                "When I first created the website, I didn't know anything about web development, and so I directly wrote the html using the Bootstrap library. The downside of this was that the website was a pain to update. After I had created Health At Home with my classmates for my Software Engineering class, I decided to completely remake my personal website in React. I used React's Functional Components to create each aspect of the site in such a way that it is easy to change one aspect of the website without breaking others. I also kept responsiveness in mind as I was re-creating the site, and as a result it also looks really good on mobile!",
                "My favorite part of the website is the way that it seperates out the data from the components. I tried to follow the MVC (Model, View, Controller) layout when designing this website, but was a little unsure about how to follow it exactly, since this site has no backend or database. After looking at some other examples, I started using json files to hold the data for the website, allowing me to update them with raw data and have the website automatically read the json and update itself. This makes things like adding projects, or items to my virtual resume really easy, since I don't need to touch the html/css at all."
            ],
            "languages":[
                "typescript"
            ],
            "tools": [
                "NodeJS",
                "React",
                "Bootstrap",
                "Sass"
            ],
            "tags": [
                "web development",
                "Resume"
            ],
            "gitURL": "https://github.com/jonathanserbent/jonathanserbent.com",
            "deployedURL": "",
            "rating": 5,
            "imageURL": "/media/shredding.jpg",
            "media": [],
            "videoURL": ""
        },
        {
            "title": "Health At Home",
            "description": "This was a website I made for my Software Engineering class. I was assigned to a team, and together we made a website focused on health and wellness. We used React and Bootstrap for the front-end, and python and flask for the back-end API, with a PostgreSQL database. We deployed the project through AWS.",
            "additionalParagraphs": [
                "In the sofware engineering class, we learned a lot about general practices that software engineers use, and then put it into practice while using comming tools like Docker and Git. We developed pipelines for out front and back end tests to run in to check that our websites were working correctly before they launched. To deploy the front end, back end, and database, we used Amazon Web Services (AWS). Our website has 3 models, each with many instances. It has Workouts, Recipes, and Health News",
                "I was working primarily on the front end team in my group. Specifically, I spent most of my time working on the Health news page. We used React and Bootstrap to create the front end, and Axios to make requests to our backend. One of the challenges we had to overcome was searching, sorting, and filtering data, and creating designs and UI that would allow the user to do these things.",
                "The Backend was written in Python using flask, and iteracts with our PostgreSQL database. The backend team was responsible for scraping public API's to get the data for our website, as well as designing a RESTful API for the frontend to consume. The backend also had to allow certain queries to contain parameters to allow for the searching sorting and filtering."
            ],
            "languages":[
                "typescript",
                "python"
            ],
            "tools": [
                "NodeJS",
                "React",
                "Bootstrap",
                "Flask",
                "PostgreSQL",
                "AWS"
            ],
            "tags": [
                "web development",
                "school",
                "Resume"
            ],
            "gitURL": "https://gitlab.com/health-at-home-team/health-at-home",
            "deployedURL": "https://www.healthathome.me",
            "rating": 5,
            "imageURL": "/media/healthAtHome.png",
            "media": [],
            "videoURL": "https://youtube.com/embed/TSbDd8kGdZ8"
        },
        {
            "title": "PintOS",
            "description": "For my operating systems class, I created a fully functioning (though simple) operating system. We implemented on top of PintOS, which is a bare-bones OS named after the fact that it is pint-sized. On top of PintOS, we implemented a command line which handled applications running simultaneously in the background, multithreading within programs, virtual memory with swap space, and a file system.",
            "additionalParagraphs": [],
            "languages":[
                "C"
            ],
            "tools": [
                "gdb"
            ],
            "tags": [
                "operating systems",
                "school",
                "Resume"
            ],
            "gitURL": "",
            "deployedURL": "",
            "rating": 3,
            "imageURL": "",
            "media": [],
            "videoURL": ""
        },
        {
            "title": "Illegal Aliens",
            "description": "A game I created over a weekend for the EGaDS Fall 2018 game jam. In this game you drive around a planet as a car with a boxing glove, defending earth from UFO's. If they get too close they will start to attack and destroy the planet. The longer you stay alive the more points you get. I created this game entirely alone and entirely from scratch, and with it, won the Best Overall Game award.",
            "additionalParagraphs": [],
            "languages":[
                "c#"
            ],
            "tools": [
                "Unity",
                "Photoshop",
                "Bosca Ceoil"
            ],
            "tags": [
                "Game"
            ],
            "gitURL": "",
            "deployedURL": "https://jonathan-serbent.itch.io/illegal-aliens",
            "rating": 3,
            "imageURL": "/media/illegalAliens.jpg",
            "media": [],
            "videoURL": ""
        },
        {
            "title": "Smooth Controls",
            "description": "This is a demo I made focused on perfecting smooth third person controls. I programmed this to control similar to Dark Souls and other third-person games I was playing at the time. The game also works with an XBOX Controller. The result was a very smooth, fully animated, 3D, third person controller. The camera was also programmed to avoid collisions and items obscuring the player.",
            "additionalParagraphs": [],
            "languages":[
                "c#"
            ],
            "tools": [
                "Unity",
                "Blender"
            ],
            "tags": [
                "Game"
            ],
            "gitURL": "",
            "deployedURL": "https://jonathan-serbent.itch.io/project-smooth-controls",
            "rating": 2,
            "imageURL": "/media/controlsGame.png",
            "media": [],
            "videoURL": ""
        },
        {
            "title": "Seamless Portals",
            "description": "This is a demo I made focused on creating seamless portals. In the demo, you can walk between 3 portals and the player will teleport around the map when they walk through them. When looking at the portal you can see through to the other side, and the transition from one portal to another is perfectly seamless.",
            "additionalParagraphs": [],
            "languages":[
                "c#"
            ],
            "tools": [
                "Unity"
            ],
            "tags": [
                "Game"
            ],
            "gitURL": "",
            "deployedURL": "https://jonathan-serbent.itch.io/project-seamless-portals",
            "rating": 3,
            "imageURL": "/media/portalsGame.png",
            "media": [],
            "videoURL": ""
        },
        {
            "title": "Terrain generation",
            "description": "This is a demo I made focused on procedurally generating terrain. For this demo I followed an online tutorial to get the general idea, then finished the project on my own. The demo uses different levels of perlin noise to generate heightmaps pseudo-randomly, and the heightmaps are then used to generate meshes, and painted to look like terrain. The result is a collection of cool looking procedurally-generated terrains.",
            "additionalParagraphs": [],
            "languages":[
                "c#"
            ],
            "tools": [
                "Unity"
            ],
            "tags": [
                "Game"
            ],
            "gitURL": "",
            "deployedURL": "https://jonathan-serbent.itch.io/project-procedural-generated-land",
            "rating": 3,
            "imageURL": "/media/terrainGenerator.png",
            "media": [],
            "videoURL": ""
        },
        {
            "title": "Jakebox Game",
            "description": "This game was created for my Game Technologies class. The purpose was to recreate a jackbox-style game with our main focus on recreating the party-style multiplayer. We deployed a flask server to handle players joining the game from the web, and created host and client UI for the game. The game was centered around taking money without getting caught. ",
            "additionalParagraphs": [],
            "languages":[
                "C++",
                "GDScript",
                "Python"
            ],
            "tools": [
                "Godot",
                "Flask"
            ],
            "tags": [
                "Game"
            ],
            "gitURL": "",
            "deployedURL": "",
            "rating": 5,
            "imageURL": "/media/jakeboxIntro.png",
            "media": [],
            "videoURL": "https://youtube.com/embed/XX00nWmqv_Y"
        }
    ]
}